from sympy import *

def 정적분():
    a = input("정 적분할 식을 적으세요. (x에 관하여 적분) : ")
    x = Symbol('x')
    b = int(input("위끝을 적으세요. : "))
    c = int(input("아래끝을 적으세요. : "))
    d = Integral(a,(x,c,b)).doit()

    print("----------------------------------------------")
    pprint(d)
    print("----------------------------------------------")

def 부정적분():
    a = input("부정적분할 식을 적으세요. (x에 관하여 적분) : ")
    x = Symbol('x')
    b = integrate((a),x)

    print("----------------------------------------------")
    pprint(b)
    print("----------------------------------------------")

while (True):
    print("----------------------------------------------")
    INTEGRATEchoice = input("부정적분 / 정적분 / 그만 두시려면 STOP 을 입력하시오. : ")
    print("----------------------------------------------")
    if INTEGRATEchoice == "부정적분":
        부정적분()
    elif INTEGRATEchoice == "정적분":
        정적분()
    elif INTEGRATEchoice == "STOP":
        break
    else :
        print("----------------------------------------------")
        print("입력하신 함수에 대한 정보가 없습니다. 다시 입력해주세요.")
        print("----------------------------------------------")
